# ContainerType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Field..::..ContainerType Property
Field Class See Also
---
Reports whether this is a simple field containing one value, or a container of multiple values.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ContainerType ContainerType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ContainerType As ContainerType
	Get
```

Visual C++
---
```text
public:
property ContainerType ContainerType {
	ContainerType get ();
}
```

# See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace